//
//  Topics.swift
//  GameJun
//
//  Created by JEON JUNHA on 2021/05/01.
//

import Foundation


struct Topics {
    static var shared = Topics()
    let topicText =
        ["영화": ["친구", "터미널", "귀멸의 칼날", "벰파이어와의 인터뷰"],
         "가수": ["트와이스", "검정치마", "아이유", "임창정", "빈지노"],
         "동물": ["개", "고양이", "호랑이", "사자", "오리", "피카츄"],
         "노래": ["아까워", "마음을 드려요", "청혼", "캔디", "뿌요뿌요"],
         "음식": ["쌀밥", "보리밥", "현미밥", "콩밥", "볶음밥", "비빔밥"],
         "위인": ["이순신", "강감찬", "이소룡", "레오니다스", "석가모니"],
         "운동": ["복싱", "태권도", "농구", "축구", "발야구", "주짓수", "미식축구"],
         "도시": ["서울", "도쿄", "북경", "뉴욕", "LA", "밴쿠버"],
         "어플": ["카카오톡", "붕세권", "쿠키런", "네이버", "배달의 민족", "코레일톡"]]
    
    
    let movie = ["친구", "터미널", "귀멸의 칼날", "벰파이어와의 인터뷰"]
    let singer = ["트와이스", "검정치마", "아이유", "임창정", "빈지노"]
    let animal = ["개", "고양이", "호랑이", "사자", "오리", "피카츄"]
    let song = ["아까워", "마음을 드려요", "청혼", "캔디", "뿌요뿌요"]
    let food = ["쌀밥", "보리밥", "현미밥", "콩밥", "볶음밥", "비빔밥"]
    let person = ["이순신", "강감찬", "이소룡", "레오니다스", "석가모니"]
    let sports = ["복싱", "태권도", "농구", "축구", "발야구", "주짓수", "미식축구"]
    let city = ["서울", "도쿄", "북경", "뉴욕", "LA", "밴쿠버"]
    let app = ["카카오톡", "붕세권", "쿠키런", "네이버", "배달의 민족", "코레일톡"]
    
    
    
    let finishedTopic: [String] = []
    
    private init(){}
}
